src/Catalogs/кфкПриложенияСпецификаций/кфкПриложенияСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкПриложенияСпецификаций</name>
</mdclass:Catalog>

src/Enums/кфкВидыПовышенияВерсий/кфкВидыПовышенияВерсий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>кфкВидыПовышенияВерсий</name>
  <enumValues>
    <name>ОсновнаяВерсия</name>
  </enumValues>
  <enumValues>
    <name>ДополняющаяВерсия</name>
  </enumValues>
  <enumValues>
    <name>ВерсияИсправления</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/кфкПриложенияСпецификаций/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПослеЗаписиВерсийИсторииДанных(ИнформацияОЗаписиВерсий)
	
//	РегистрыСведений.кфкИзмененияОбъектовСпецификаций.ОбработкаЗаписиВерсийИсторииДанных(ИнформацияОЗаписиВерсий);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьВидПовышения(Данные, История, ЭтоНовый) Экспорт
	
	ВидыПовышения = Перечисления.кфкВидыПовышенияВерсий;
	ИндексыПовышения = ВидыПовышения.Индексы();
	Результат = 9;
	
	Если ТипЗнч(История) = Тип("ИнформацияОЗаписиВерсииИсторииДанных") Тогда // Новый объект или удаление старого объекта
		Если ЭтоНовый Тогда
			Если История.ВидИзмененияДанных = ВидИзмененияДанных.Добавление Тогда
				ВидПовышения = ВидыПовышения.ДополняющаяВерсия;
				
			ИначеЕсли История.ВидИзмененияДанных = ВидИзмененияДанных.Изменение Тогда
				ВидПовышения = ?(
					ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(История.ДанныеВерсии, "ПометкаУдаления", Ложь),
					ВидыПовышения.ПустаяСсылка(), ВидыПовышения.ДополняющаяВерсия);
				
			Иначе
				ВидПовышения = ВидыПовышения.ПустаяСсылка();
				
			КонецЕсли;
			
		ИначеЕсли История.ВидИзмененияДанных = ВидИзмененияДанных.Удаление Тогда
			ВидПовышения = ВидыПовышения.ОсновнаяВерсия;
			
		Иначе
			ВызватьИсключение НСтр("ru = 'Недопустимый сценарий изменения!'");
			
		КонецЕсли;
		Результат = ИндексыПовышения.Найти(ВидПовышения);
		
	Иначе
		Для Каждого КлючЗначение Из История Цикл
			ИмяРеквизита = КлючЗначение.Ключ;
			Изменения = КлючЗначение.Значение;
			
			Если ИмяРеквизита = "ПометкаУдаления" Тогда
				ВидПовышения = ?(Изменения.ЗначениеПослеИзменения,
					ВидыПовышения.ДополняющаяВерсия, ВидыПовышения.ВерсияИсправления);
				Результат = ИндексыПовышения.Найти(ВидПовышения);
				Прервать; // Признак удаления имеет приоритет
				
			ИначеЕсли ИмяРеквизита = "Наименование" Тогда
				ВидПовышения = ВидыПовышения.ВерсияИсправления;
				
			Иначе
				ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестное имя реквизита: %1'"), ИмяРеквизита);
			КонецЕсли;
			
			Результат = Мин(Результат, ИндексыПовышения.Найти(ВидПовышения));
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат ?(Результат = 9, -1, Результат);
	
КонецФункции

#КонецОбласти

#КонецЕсли
